package Task3;
/*
Задание 3#
Напишите метод, который будет подсчитывать частоту каждого слова в файле words.txt.
Предполагаем, что:
    words.txt содержит только слова в нижнем регистре, разделенные пробелом
    Каждое слово содержит только символы-буквы в нижнем регистре.
    Слова разделены одим или несколькими пробелами, либо переносом строки.
Пример:
Для файла words.txt со следующим содержанием:
        the day is sunny the the
        the sunny is is
Метод должен вернуть частоту:
        the 4
        is 3
        sunny 2
        day 1
Обратите внимание! Вывод на консоль должен быть отсортирован на частоте слов (от наибольшей к наименьшей)
*/
public class WordsCounter {
}
